# Jenkins: 
ARG JENKINS_AWS_ACCESS_KEY_ID
ARG JENKINS_AWS_SECRET_ACCESS_KEY
RUN mkdir ~/.aws && \
    chmod 600 ~/.aws && \
    touch ~/.aws/config && \
    touch ~/.aws/credentials && \
    echo [default] $'\n' region = us-east-1 > ~/.aws/config &&\
    echo [default] $'\n' aws_access_key_id = $JENKINS_AWS_ACCESS_KEY_ID $'\n' aws_secret_access_key = $JENKINS_AWS_SECRET_ACCESS_KEY > ~/.aws/credentials


# Test
FROM python:3.7.2-alpine3.8
LABEL maintainer="jeffmshale@gmail.com"
# Устанавливаем зависимости
RUN apk add --update git
# Задаём текущую рабочую директорию
WORKDIR /usr/src/my_app_directory
# Копируем код из локального контекста в рабочую директорию образа
COPY . .
# Задаём значение по умолчанию для переменной
ARG my_var=my_default_value
# Настраиваем команду, которая должна быть запущена в контейнере во время его выполнения
ENTRYPOINT ["python", "./app/my_script.py", "my_var"]
# Открываем порты
EXPOSE 8000
# Создаём том для хранения данных
VOLUME /my_volume



Where:
# Comment
FROM — задаёт базовый (родительский) образ.
LABEL — описывает метаданные. Например — сведения о том, кто создал и поддерживает образ.
ENV — устанавливает постоянные переменные среды.
ARG — задаёт переменные для передачи Docker во время сборки образа.
WORKDIR — задаёт рабочую директорию для следующей инструкции.
USER - Задает пользователя (по имени или по идентификатору UID) для использования во всех последующих инструкциях RUN , CMD , ENTRYPOINT
RUN — выполняет команду и создаёт слой образа. Используется для установки в контейнер пакетов.
COPY — копирует в контейнер файлы и папки.
ADD — копирует файлы и папки в контейнер, может распаковывать локальные .tar-файлы. Умеет скачивать файлы
EXPOSE — указывает на необходимость открыть порт.
VOLUME — создаёт точку монтирования для работы с постоянным хранилищем.
ONBUILD - Определяет инструкцию, которая должна выполняться позже, когда данный образ будет использоваться как основной уровень для другого образа.

ENTRYPOINT — предоставляет команду с аргументами для вызова во время выполнения контейнера. Аргументы не переопределяются.
CMD — описывает команду с аргументами, которую нужно выполнить когда контейнер будет запущен. Аргументы могут быть переопределены при запуске контейнера. 
CMD и ENTRYPOINT выполняются в момент запуска контейнера, только инструкция CMD позволяет переопределить передаваемые команде аргументы.
